# 1. Напишите программу, которая принимает на вход число N и выдаёт последовательность из N членов.
# *Пример:*
# - Для N = 5: 1, -3, 9, -27, 81

# *- распаковывает список, строку и т.д
# =================================================
# from random import randint

# for _ in range(int(input('Введите число: '))):
#     print(randint(0, 100), end=' ')
# =================================================

# 2. Для натурального n создать словарь индекс-значение, состоящий из элементов последовательности 3n + 1.
# *Пример:*
# - Для n = 6: {1: 4, 2: 7, 3: 10, 4: 13, 5: 16, 6: 19}
# =================================================

# n = int(input('Введите число: '))
# my_dict = []
# for i in range(1, n + 1):

#     my_dict.append([i, i * 3 + 1])
# print(my_dict)


# 2й способ ============================
# n = int(input('Введите число: '))
# my_dict = []
# for i in range(1, n + 1):

#     my_dict.append([i, i * 3 + 1])
# print(dict(my_dict))


# =================================================
# 3. Напишите программу, в которой пользователь будет задавать две строки,
# а программа - определять количество вхождений одной строки в другой.
text1 = input("Stroing ")
text2 = input("Substring ")

count = 0
for i in range(len(text1)):
    match = len(text2)
for j in range(len(text2)):
    if j+i >= len(text1) or text1[j+i] != text2[j]:
        break
    else:
        match = match - 1
    if match == 0:
        count = count + 1
print(count)
